export const ALERTS_CONTENT = {
    REGISTRATION: {
        EMAIL_UNIQUE: 'Пользователь с таким Email уже зарегистрирован',
        LOGIN_UNIQUE: 'ПОльзователь с таким логином уже есть',
    },
    LOGIN: {
        WRONG_EMAIL_OR_PASSWORD: 'Неверное имя пользователя или пароль'
    }
}

export const USER_KEYS = {
    ID: "ID",
    LOGIN: "LOGIN",
    PASSWORD: "PASSWORD",
    EMAIL: "EMAIL",
    ROLE_ID: "ROLE_ID",
}

export const ZONES = {
    1: ['Ё', '!', '"', 'Й', 'Ф', 'Я', '*', 'Ш', 'Л', 'Б', 'ё', '1', '2', 'й', 'ф', 'я', '8', 'ш', 'л','б', ' '],
    2: ['№', 'Ц', 'Ы', 'Ч', '(', 'Щ', 'Д', 'Ю', '3', ' ', 'ц', 'ы', 'ч', '9', 'щ', 'д', 'ю'],
    3: [';', 'У', 'В', 'С', ')', 'З', 'Ж', '_', 'Х', 'Э', '+', 'Ъ', ' ',',', '4', 'у', 'в', 'с', '0', 'з', 'ж', ' ', '.', '-', 'х', 'э', '=', 'ъ'],
    4: ['%', ':', 'К', 'А', 'М', 'Е', 'П', 'И', '5', '6', 'к', 'а', 'м', 'е', 'п', 'и', '?', ' ','Н', 'Р', 'Т', 'Г', 'О', 'Ь', '7', 'н', 'р', 'т', 'г', 'о', 'ь']
}
